emacsrc.org
#+AUTHOR: Markus Bayer
#+BABEL: :cache yes
#+DATE: <2016-06-03 Fr 18:35>
#+PROPERTY: header-args :tangle yes

   ███████╗███╗   ███╗ █████╗  ██████╗███████╗██████╗  ██████╗
   ██╔════╝████╗ ████║██╔══██╗██╔════╝██╔════╝██╔══██╗██╔════╝
   █████╗  ██╔████╔██║███████║██║     ███████╗██████╔╝██║
   ██╔══╝  ██║╚██╔╝██║██╔══██║██║     ╚════██║██╔══██╗██║
██╗███████╗██║ ╚═╝ ██║██║  ██║╚██████╗███████║██║  ██║╚██████╗
╚═╝╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝╚══════╝╚═╝  ╚═╝ ╚═════╝

ASCII-Art credits: http://patorjk.com/software/taag/#p=testall&h=0&v=0&f=ANSI%20Shadow&t=.emacsrc

* setup

** persistence files

#+BEGIN_SRC sh :tangle no
mkdir ~/.emacs.d/persistence
touch ~/.emacs.d/persistence/recentf
touch ~/.emacs.d/persistence/workgroups
touch ~/.emacs.d/persistence/places
touch ~/.emacs.d/persistence/bookmarks
# cp ~/.emacs.d/bookmarks ~/.emacs.d/persistence/bookmarks

git clone https://github.com/TeMPOraL/nyan-mode.git ~/.emacs.d/other-srcs
git clone https://github.com/alpaker/Fill-Column-Indicator.git ~/.emacs.d/other-srcs
git clone https://github.com/philiparvidsson/zweilight-emacs.git ~/.emacs.d/other-srcs
git clone https://github.com/dunn/company-emoji.git ~/.emacs.d/other-srcs
#+END_SRC

** external dependencies

#+BEGIN_SRC sh :tangle no
# silver searcher
brew install ag
# howdoi
pip install howdoi
# elpy
pip install jedi flake8 importmagic autopep8
# tern
npm install -g tern
# js2-mode
npm install -g jshint
npm install -g eslint
#+END_SRC

** jedi

M-x jedi:install-server

* package management

** packages

To load downloaded packages we need to
initialize =package=. =cl= is a library that contains many functions from
Common Lisp, and comes in handy quite often, so we want to make sure it's
loaded, along with =package=, which is obviously needed.

#+BEGIN_SRC emacs-lisp
(package-initialize)
(require 'package)
(require 'cl)
(setq package-enable-at-startup nil)
#+END_SRC

Setup package archives.

#+BEGIN_SRC emacs-lisp
(setq package-archives
        '(("gnu" . "http://elpa.gnu.org/packages/")
         ("org" . "http://orgmode.org/elpa/")
         ("melpa" . "https://melpa.org/packages/")
         ("melpa-stable" . "https://stable.melpa.org/packages/")
         ; ("elpy" . "https://jorgenschaefer.github.io/packages/")
))

;; (add-to-list 'package-pinned-packages '(cider . "melpa-stable") t)
#+END_SRC

