emacsrc.el
            '(auto-compile              ; automatically compile Emacs Lisp libraries
                evil                    ; extensible vi layer
                evil-leader             ; the <leader> feature from Vim
                evil-search-highlight-persist             ; highlight the search term in all buffers persistently
                evil-nerd-commenter     ; comment code efficiently
                helm                    ; Incremental and narrowing framework
                expand-region           ; Increases the selected region by semantic units
                yasnippet               ; template system
                flycheck                ; modern on-the-fly syntax checking extension
                git-gutter              ; icons in the gutter area indicating src ctrl changes
                undo-tree               ; undo system
                ;; auto-complete           ; auto completion with popup menu
                company                 ; auto completion with popup menu
                helm-c-yasnippet        ; helm completion for company-mode
                json-snatcher           ; extract the path to a json value, display at modeline
                fireplace               ; a cozy fireplace
                jedi                    ; Python auto-completion for Emacs
                idle-require            ; load elisp libraries while Emacs is idle
                avy                     ; jumping to visible text using a char-based decision tree
                restclient              ; tool to manually explore and test HTTP REST webservices
                js2-mode                ; Improved JavaScript editing mode
                web-mode                ; major mode for editing web templates aka HTML files
                dumb-jump               ; "jump to definition" with support for multiple programming languages
                helm-swoop              ; Efficiently hopping squeezed lines
                smartparens             ; minor mode for dealing with pairs
                which-key               ; minor mode for Emacs that displays the key bindings following your currently entered incomplete command (a prefix) in a popup
                helm-projectile         ; Helm integration for Projectile
                magit                   ; control Git from Emacs
                spaceline               ; Spacemacs powerline theme
                workgroups2             ; session manager
                howdoi                  ; query Stack Overflow, get the most upvoted answer to the first question
                markdown-mode           ; major mode for editing markdown
                ;; smart-mode-line         ; sexy mode-line
                ;; smart-mode-line-powerline-theme
                ;; new package
                ;; themes
                gruvbox-theme           ; light & dark
                solarized-theme         ; light & dark
                spacemacs-theme         ; light & dark
                moe-theme               ; light & dark
                material-theme          ; light & dark
                color-theme-sanityinc-tomorrow ; light & dark
                darcula-theme           ; dark
                leuven-theme            ; light
                organic-green-theme     ; light
                monokai-theme           ; dark
                zenburn-theme           ; dark
                cyberpunk-theme         ; dark
                subatomic-theme         ; dark
                grandshell-theme        ; dark
                afternoon-theme         ; dark
                noctilux-theme          ; dark
                darktooth-theme         ; dark
                gotham-theme            ; dark
                doom-themes             ; light & dark
                spacegray-theme         ; dark
                obsidian-theme          ; dark
                metalheart-theme        ; dark
                badwolf-theme           ; light & dark
                inkpot-theme            ; dark
                seoul256-theme          ; dark
                suscolors-theme         ; dark
                avk-emacs-themes        ; collection
                quasi-monochrome-theme  ; dark
                hemisu-theme            ; light & dark
                cherry-blossom-theme    ; theme
                darkburn-theme          ; dark
                clues-theme             ; dark
                reykjavik-theme         ; dark
                sublime-themes          ; collection
                silkworm-theme          ; dark
                labburn-theme           ; dark
                org                     ; Outline-based notes management and organizer
                org-autolist            ; Automatically insert new list items.
                ;; always load finally
                ox-rst                  ; Export reStructuredText
                ox-odt                  ; Export OpenDocument
                ox-md                   ; Markdown exporter (from org)
                ;; cider                ; Clojure Interactive Development Environment
                ;; company              ; Modular text completion framework
                ;; define-word          ; display the definition of word at point
                ;; diminish             ; Diminished modes from modeline
                ;; drag-stuff           ; Drag stuff around in Emacs
                ;; expand-region        ; Increase selected region by semantic units
                ;; focus                ; Dim color of text in surrounding sections
                ;; geiser               ; GNU Emacs and Scheme talk to each other
                ;; git-gutter-fringe    ; Fringe version of git-gutter.el
                ;; golden-ratio         ; Automatic resizing windows to golden ratio
                ;; haskell-mode         ; A Haskell editing mode
                ;; helm-company         ; Helm interface for company-mode
                ;; maude-mode           ; Emacs mode for the programming language Maude
                ;; multiple-cursors     ; Multiple cursors for Emacs
                ;; olivetti             ; Minor mode for a nice writing environment
                ;; paredit              ; minor mode for editing parentheses
                ;; pdf-tools            ; Emacs support library for PDF files
                ;; projectile           ; Manage and navigate projects in Emacs easily
                ;; slime                ; Superior Lisp Interaction Mode for Emacs
                ;; try))                ; Try out Emacs packages
                ))
            ;; Remove all packages already installed
            (packages (remove-if 'package-installed-p packages)))
        ;; TODO only connect if neccessary
        (when packages
            (ignore-errors (package-refresh-contents)
                        (mapcar 'package-install packages)
                        ;; macOS
                        (when (memq window-system '(mac ns))
                            (package-install 'exec-path-from-shell))))))
