emacsrc.org
* emacsrc.org setup

initial init.d content

#+BEGIN_SRC emacs-lisp :tangle no
;; require org for tangling
(require 'org)
;; open the configuration
(find-file (concat user-emacs-directory "emacsrc.org"))
;; tangle it
#+TITLE: Emacs configuration file
#+AUTHOR: Markus Bayer
#+BABEL: :cache yes
#+DATE: <2016-06-03 Fr 18:35>
#+PROPERTY: header-args
#+BEGIN_SRC emacs-lisp: tangle no
(org-babel-tangle)
;; load it
(load-file (concat user-emacs-directory "emacsrc.el"))
;; finally byte-compile it
(byte-compile-file (concat user-emacs-directory "emacsrc.el"))
#+END_SRC

always tangle and byte-compile the =org=-document after changes.

#+BEGIN_SRC emacs-lisp
(defun tangle-init ()
"If the current buffer is 'init.org' the code-blocks are tangled, and
the tangled file is compiled."
(when (equal (buffer-file-name)
    (expand-file-name "~/Settings/dotfiles/emacsrc.org"))
    ;; avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
    (org-babel-tangle)
    (byte-compile-file (expand-file-name
        (concat user-emacs-directory "init.el"))))))

(add-hook 'after-save-hook 'tangle-init)
#+END_SRC

* general

** load path

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name
    (concat user-emacs-directory "other-srcs/lisp")))
#+END_SRC

** theme

    #+BEGIN_SRC emacs-lisp
    ;; theme
    ;; trust theme
    (setq custom-safe-themes t)
    ;; (load-theme 'spacemacs-dark)
    ;; (load-theme 'spacemacs-light)
    ;; (load-theme 'rebecca)
    (load-theme 'zenburn)
    ;; (load-theme 'reykjavik)
    ;; (load-theme 'darcula)
    ;; (load-theme 'monokai)
    ;; (load-theme 'sanityinc-tomorrow-blue)
    ;; (load-theme 'darktooth)
    ;; set font
    (set-frame-font "Envy Code R 16")
    #+END_SRC

** symlinks

    #+BEGIN_SRC emacs-lisp
    ;; follow symbolic links
    ;; (setq vc-follow-symlinks t)
    #+END_SRC

** cursor

    #+BEGIN_SRC emacs-lisp
    ;; disable blinking cursor
    (blink-cursor-mode 0)
    ;; disable audio bell
    (setq ring-bell-function 'ignore)
    ;; remember cursor position
    (if (version< emacs-version "25.0")
        (progn
            (require 'saveplace)
      (setq-default save-place t))
      (setq save-place-file (concat user-emacs-directory "persistence/places"))
      (save-place-mode 1))
    #+END_SRC

** encryption
https://www.emacswiki.org/emacs/mc-auto-encrypt.el

#+BEGIN_SRC elisp
   (require 'epa-file)
   (custom-set-variables '(epg-gpg-program  "/usr/local/MacGPG2/bin/gpg2"))
#+END_SRC

** UI                                                               :manual:

    #+BEGIN_SRC emacs-lisp
    ;; disable welcome window
    (setq ns-pop-up-frames nil)

    ;; disable tool-bar
    (tool-bar-mode -1)

    ;; show line numbers
    (global-linum-mode t)

    ;; y & n instead of yes & no
    (fset 'yes-or-no-p 'y-or-n-p)

    ;; 80-column-ruler
    (add-to-list 'load-path (expand-file-name
        (concat user-emacs-directory "other-srcs/Fill-Column-Indicator")))
    (setq fci-rule-column 81)
    (require 'fill-column-indicator)

    ;; TODO define list of used programming languages (prog-mode doesn't work with js)
    (add-hook 'python-mode-hook 'turn-on-fci-mode)
    (add-hook 'js-mode-hook 'turn-on-fci-mode)

    ;; highlight current line
    (global-hl-line-mode)

    ;; wrap long lines
    (global-visual-line-mode)
    ;(set-default 'truncate-lines t)

    ;; start fullscreen
    ;(toggle-frame-maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized))
    #+END_SRC

*** modeline

    #+BEGIN_SRC emacs-lisp
    ;; display column number
    (setq column-number-mode t)
    #+END_SRC

*** frames

#+BEGIN_SRC emacs-lisp
;; switch frames with <Shift-Left/Right/Up/Down>
(windmove-default-keybindings)
#+END_SRC

** lines

no forced new line

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC

** whitespace

    #+BEGIN_SRC emacs-lisp
    ;; show trailing whitespace
    (setq-default show-trailing-whitespace t)

    ;;; use 4 spaces instead of tabs
    (setq-default indent-tabs-mode nil)
    (setq-default tab-width 4)

   ;; (setq indent-line-function 'insert-tab)
    #+END_SRC

** encoding

    #+BEGIN_SRC emacs-lisp
    (set-language-environment "UTF-8")
    #+END_SRC

** paranthesis

    #+BEGIN_SRC emacs-lisp
    (show-paren-mode 1)
    (require 'paren)
    (set-face-background 'show-paren-match (face-background 'default))
    (set-face-foreground 'show-paren-match "#FF0097")
    (set-face-attribute 'show-paren-match nil :weight 'extra-bold)
    (electric-pair-mode)
    #+END_SRC

** temporary files

    #+BEGIN_SRC emacs-lisp
    ;; paths
    (setq auto-save-file-name-transforms
              `((".*" ,(concat user-emacs-directory "tmp/auto-save/") t)))
    (setq backup-directory-alist
          `(("." . ,(expand-file-name
                     (concat user-emacs-directory "tmp/backup/")))))
    ;; backup method
    (setq backup-by-copying t)
    ;; backup frequency
    (setq delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)

    ;;TOTRY
    ;;(setq savehist-file "~/.emacs.d/savehist")
    ;;(savehist-mode 1)
    ;;(setq history-length t)
    ;;(setq history-delete-duplicates t)
    ;;(setq savehist-save-minibuffer-history 1)
    ;;(setq savehist-additional-variables
    ;;'(kill-ring
    ;;    search-ring
    ;;    regexp-search-ring))
    #+END_SRC

** file modes

map files to major-modes

#+BEGIN_SRC emacs-lisp
;; TODO shebangs, doesn't work
(add-to-list 'magic-mode-alist '("# vim: set ft=zsh ts=4 sw=4 expandtab :" . sh-mode))
(add-to-list 'auto-mode-alist '("\\.zsh\\'" . sh-mode))
#+END_SRC

* packages

** bookmarks                                                       :builtin:

emacs throws the error "Not bookmark format" if the file is empty.
As a workaround let emacs create the file under the default path
and copy it over the desired file.

#+BEGIN_SRC emacs-lisp
;; persist bookmarks in this file
(setq bookmark-default-file (concat user-emacs-directory "persistence/bookmarks"))
#+END_SRC

** zone                                                            :builtin:

#+BEGIN_SRC emacs-lisp
;; required by require
(defun zone-choose (pgm)
    "Choose a PGM to run for `zone'."
    (interactive
        (list
        (completing-read
        "Program: "
        (mapcar 'symbol-name zone-programs))))
    (let ((zone-programs (list (intern pgm))))
        (zone)))
#+END_SRC

** evil-leader

#+BEGIN_SRC emacs-lisp
(require 'evil-leader)
(global-evil-leader-mode)
;; set space as leader-key
(evil-leader/set-leader "<SPC>")
#+END_SRC

** evil

#+BEGIN_SRC emacs-lisp
;; use evil search instead of isearch
(setq evil-search-module 'evil-search)
(require 'evil)
(evil-mode 1)
;; let evil treat _ as part of a word
(setq-default evil-symbol-word-search t)
#+END_SRC

** org-mode                                                        :builtin:

#+BEGIN_SRC emacs-lisp
;; org-mode for .org-files
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
;; required by require
(setq org-log-done t)
;; setup priorities from A-Z
(setq org-highest-priority ?A)
(setq org-lowest-priority ?Z)
(setq org-default-priority ?A)
;; define states
(setq org-todo-keywords
       '((sequence "TODO" "NEXT" "BLOCKED" "|" "DONE")))
;; concat agenda from this files
(setq org-agenda-files (append '("~/.notes.org" "~/Documents/org/plan/agenda.org") (file-expand-wildcards "~/Documents/org/cal/*\.org")))

;; indentation options
(setq org-startup-folded "showeverything")
;; In this minor mode, all lines are prefixed for display with the necessary amount of space.
;; All headline stars but the last one are made invisible
(add-hook 'org-mode-hook
          (lambda () (org-indent-mode t)) t)

;; initial langauges for org-babel support
(org-babel-do-load-languages
    'org-babel-load-languages '(
        (sh . t)
        (python . t)
        (ruby . t)
        (sqlite . t)
        (java . t)
        (js . t)
        (sql . t)
        (css . t)
))

;; automatically insert list items
;; required by require
(add-hook 'org-mode-hook (lambda () (org-autolist-mode)))

;; org-capture
(setq org-default-notes-file "~/Documents/org/backlog.org")

(setq org-capture-templates
'(("t" "Todo" entry (file "~/Documents/org/backlog.org")
        "* TODO %?")))
#+END_SRC

** python

#+BEGIN_SRC emacs-lisp :tangle yes
;(setq python-shell-interpreter "ipython"
;      python-shell-interpreter-args "--simple-prompt --pprint")
(setq python-shell-interpreter "ipython")

(defun python-shell ()
        "Start and/or switch to the REPL."
        (interactive)
        (let ((shell-process
               (or (python-shell-get-process)
                   ;; `run-python' has different return values and different
                   ;; errors in different emacs versions. In 24.4, it throws an
                   ;; error when the process didn't start, but in 25.1 it
                   ;; doesn't throw an error, so we demote errors here and
                   ;; check the process later
                   (with-demoted-errors "Error: %S"
                     ;; in Emacs 24.5 and 24.4, `run-python' doesn't return the
                     ;; shell process
                     (call-interactively #'run-python)
                     (python-shell-get-process)))))
          (unless shell-process
            (error "Failed to start python shell properly"))
          (pop-to-buffer (process-buffer shell-process))
          'anaconda-mode
          'anaconda-eldoc-mode
          (evil-insert-state)))
#+END_SRC

** anaconda-mode

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'python-mode-hook 'anaconda-mode)
(add-hook 'python-mode-hook 'anaconda-eldoc-mode)
#+END_SRC

** company-anaconda

#+BEGIN_SRC emacs-lisp :tangle yes
(eval-after-load "company"
 '(add-to-list 'company-backends 'company-anaconda))

(add-hook 'python-mode-hook 'anaconda-mode)
#+END_SRC

** company-tern

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'js2-mode-hook 'tern-mode)
(eval-after-load "company"
 '(add-to-list 'company-backends 'company-tern))
#+END_SRC

** helm

#+BEGIN_SRC emacs-lisp
(require 'helm-config)
;; TODO experimental
(setq helm-M-x-fuzzy-match t
      helm-buffers-fuzzy-matching t
      helm-recentf-fuzzy-match t)
#+END_SRC

** flycheck

#+BEGIN_SRC emacs-lisp
;; TODO only init for src files
;; required by require
(add-hook 'after-init-hook #'global-flycheck-mode)
;; TODO customize error window
#+END_SRC

** yasnippet

#+BEGIN_SRC emacs-lisp
;; yasnippet everywhere
(yas-global-mode 1)

;; required by require
;; snippet direcories
;; ~/emacs.d/elpa/yasnippet-20161022.646/snippets
;; ~/emacs.d/snippets
#+END_SRC

