emacsrc.el

(defun tangle-init ()
"If the current buffer is 'init.org' the code-blocks are tangled, and
the tangled file is compiled."
(when (equal (buffer-file-name)
    (expand-file-name "~/Settings/dotfiles/emacsrc.org"))
    ;; avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
    (org-babel-tangle)
    (byte-compile-file (expand-file-name
        (concat user-emacs-directory "init.el"))))))

(add-hook 'after-save-hook 'tangle-init)

(add-to-list 'load-path (expand-file-name
    (concat user-emacs-directory "other-srcs/lisp")))

;; theme
;; trust theme
(setq custom-safe-themes t)
;; (load-theme 'spacemacs-dark)
;; (load-theme 'reykjavik)
(load-theme 'darcula)
(load-theme 'monokai)
;; (load-theme 'darktooth)
;; set font
(set-default-font "Envy Code R 16")

;; disable blinking cursor
(blink-cursor-mode 0)
;; disable audio bell
(setq ring-bell-function 'ignore)
;; remember cursor position
(if (version< emacs-version "25.0")
    (progn
        (require 'saveplace)
  (setq-default save-place t))
  (setq save-place-file (concat user-emacs-directory "persistence/places"))
  (save-place-mode 1))

;; disable welcome window
(setq ns-pop-up-frames nil)

;; disable tool-bar
(tool-bar-mode -1)

;; show line numbers
(global-linum-mode t)

;; y & n instead of yes & no
(fset 'yes-or-no-p 'y-or-n-p)

;; 80-column-ruler
(add-to-list 'load-path (expand-file-name
    (concat user-emacs-directory "other-srcs/Fill-Column-Indicator")))
(require 'fill-column-indicator)

;; TODO define list of used programming languages (prog-mode doesn't work with js)
(add-hook 'python-mode-hook 'turn-on-fci-mode)
(add-hook 'js-mode-hook 'turn-on-fci-mode)

;; highlight current line
(global-hl-line-mode)

;; wrap long lines
(global-visual-line-mode)

;; start fullscreen
;(toggle-frame-maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; display column number
(setq column-number-mode t)

;; switch frames with <Shift-Left/Right/Up/Down>
(windmove-default-keybindings)

(setq-default indent-tabs-mode nil)

;; show trailing whitespace
(setq-default show-trailing-whitespace t)
;;; use 4 spaces instead of tabs
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)

;; (setq indent-line-function 'insert-tab)

(set-language-environment "UTF-8")

(show-paren-mode 1)
(require 'paren)
(set-face-background 'show-paren-match (face-background 'default))
(set-face-foreground 'show-paren-match "#FF0097")
(set-face-attribute 'show-paren-match nil :weight 'extra-bold)

;; paths
(setq auto-save-file-name-transforms
          `((".*" ,(concat user-emacs-directory "tmp/auto-save/") t)))
(setq backup-directory-alist
      `(("." . ,(expand-file-name
                 (concat user-emacs-directory "tmp/backup")))))
;; backup method
(setq backup-by-copying t)
;; backup frequency
(setq delete-old-versions t
  kept-new-versions 6
  kept-old-versions 2
  version-control t)

;; TODO shebangs, doesn't work
(add-to-list 'magic-mode-alist '("# vim: set ft=zsh ts=4 sw=4 expandtab :" . sh-mode))
(add-to-list 'auto-mode-alist '("\\.zsh\\'" . sh-mode))

;; persist bookmarks in this file
(setq bookmark-default-file (concat user-emacs-directory "persistence/bookmarks"))

;; required by require
(defun zone-choose (pgm)
    "Choose a PGM to run for `zone'."
    (interactive
        (list
        (completing-read
        "Program: "
        (mapcar 'symbol-name zone-programs))))
    (let ((zone-programs (list (intern pgm))))
        (zone)))

(require 'evil-leader)
(global-evil-leader-mode)
;; set space as leader-key
(evil-leader/set-leader "<SPC>")

;; use evil search instead of isearch
(setq evil-search-module 'evil-search)
(require 'evil)
(evil-mode 1)
;; let evil treat _ as part of a word
(setq-default evil-symbol-word-search t)

;; org-mode for .org-files
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
;; required by require
(setq org-log-done t)
;; setup priorities from A-Z
(setq org-highest-priority ?A)
(setq org-lowest-priority ?Z)
(setq org-default-priority ?A)
;; concat agenda from this files
(setq org-agenda-files (append '("~/.notes.org" "~/Documents/org/plan/backlog.org") (file-expand-wildcards "~/Documents/org/cal/*\.org")))

;; indentation options
(setq org-startup-folded "showeverything")
;; In this minor mode, all lines are prefixed for display with the necessary amount of space.
;; All headline stars but the last one are made invisible
(add-hook 'org-mode-hook
          (lambda () (org-indent-mode t)) t)

;; initial langauges for org-babel support
(org-babel-do-load-languages
    'org-babel-load-languages '(
        (sh . t)
        (python . t)
        (ruby . t)
        (sqlite . t)
        (java . t)
        (js . t)
        (sql . t)
        (css . t)
))

;; automatically insert list items
;; required by require
(add-hook 'org-mode-hook (lambda () (org-autolist-mode)))

(require 'helm-config)
;; TODO experimental
(setq helm-M-x-fuzzy-match t
      helm-buffers-fuzzy-matching t
      helm-recentf-fuzzy-match    t)

;; TODO only init for src files
;; required by require
(add-hook 'after-init-hook #'global-flycheck-mode)
;; TODO customize error window

;; required by require
;; snippet direcories
(setq yas-snippet-dirs
         '("~/.emacs.d/user-snippets"
         ))
;; yasnippet everywhere
(yas-global-mode 1)

;; required by require
