emacsrc.org
** git-gutter

#+BEGIN_SRC emacs-lisp
;; required by require
(global-git-gutter-mode +1)
; live update
(custom-set-variables
    '(git-gutter:update-interval 1)
    '(git-gutter:modified-sign "~")
    ; '(git-gutter:added-sign "+")
    ; '(git-gutter:deleted-sign "-")
)
#+END_SRC

** undo-tree

#+BEGIN_SRC emacs-lisp
;; required by require
(global-undo-tree-mode)
#+END_SRC

** company-mode

Basically it sets up the yasnippet backend with every other backend you have activated, so you get the proper completion for the corresponding backend as well as your snippets.

#+BEGIN_SRC emacs-lisp
(add-hook 'after-init-hook 'global-company-mode)

;; fix the company popup (80-column-ruler break it)
(defun on-off-fci-before-company(command)
  (when (string= "show" command)
    (turn-off-fci-mode))
  (when (string= "hide" command)
    (turn-on-fci-mode)))

(advice-add 'company-call-frontends :before #'on-off-fci-before-company)

;; complete with tab
;(defun complete-or-indent ()
;    (interactive)
;    (if (company-manual-begin)
;        (company-complete-common)
;        (indent-according-to-mode)))

;; ;; Add yasnippet support for all company backends
;; ;; https://github.com/syl20bnr/spacemacs/pull/179
;; (defvar company-mode/enable-yas t
;;   "Enable yasnippet for all backends.")
;;
;; (defun company-mode/backend-with-yas (backend)
;;   (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
;;       backend
;;     (append (if (consp backend) backend (list backend))
;;             '(:with company-yasnippet))))
;;
;; (setq company-backends (mapcar #'company-mode/backend-with-yas company-backends))
#+END_SRC

** auto-complete

#+BEGIN_SRC emacs-lisp
;; (require 'auto-complete)
;; ;; TODO deactivate for minibuffer
;; (global-auto-complete-mode t)
;; (ac-config-default)
;; (setq ac-sources (append '(ac-source-yasnippet) ac-sources))
#+END_SRC

** jedi                                                             :manual:
M-x jedi:install-server

#+BEGIN_SRC emacs-lisp
;(add-hook 'python-mode-hook 'jedi:setup)
;(setq jedi:complete-on-dot t)
#+END_SRC

** json-snatcher

#+BEGIN_SRC emacs-lisp
;; required by require
(defun js-mode-bindings ()
"Sets a hotkey for using the json-snatcher plugin"
    (when (string-match  "\\.json$" (buffer-name))
        ;;; TODO map @ mappings
    (local-set-key (kbd "C-c C-g") 'jsons-print-path)))
(add-hook 'js-mode-hook 'js-mode-bindings)
(add-hook 'js2-mode-hook 'js-mode-bindings)
#+END_SRC

** nyan-mode                                                        :manual:

depends on https://github.com/TeMPOraL/nyan-mode.git
expected at [[~/.emacs.d/other-srcs/nyan-mode][nyan-mode]]
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name
    (concat user-emacs-directory "other-srcs/nyan-mode")))
(require 'nyan-mode)
(nyan-mode)
#+END_SRC

** js2-mode

#+BEGIN_SRC emacs-lisp
(require 'js2-mode)
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
;; TODO test indentation
(custom-set-variables
 '(js2-basic-offset 4)
 '(js2-bounce-indent-p t)
)
#+END_SRC

** skewer-mode

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'js2-mode-hook 'skewer-mode)
(add-hook 'css-mode-hook 'skewer-css-mode)
(add-hook 'html-mode-hook 'skewer-html-mode)
#+END_SRC

** web-mode

#+BEGIN_SRC emacs-lisp
(require 'web-mode)

(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))

;; highlight matching tags
;; TODO: do it like vims match-tag-always
(setq web-mode-enable-current-element-highlight t)

(defun my-web-mode-hook ()
  "Hooks for Web mode."
  (setq web-mode-markup-indent-offset 2)
)
(add-hook 'web-mode-hook  'my-web-mode-hook)
#+END_SRC

** evil-surround

#+BEGIN_SRC emacs-lisp
(require 'evil-surround)
(global-evil-surround-mode 1)
#+END_SRC

** which-key

#+BEGIN_SRC emacs-lisp
(require 'which-key)
(which-key-mode)
#+END_SRC

** TODO smart-mode-line

decide

 #+BEGIN_SRC emacs-lisp :tangle no
(setq powerline-arrow-shape 'curve)
(setq powerline-default-separator-dir '(right . left))
(setq sml/theme 'powerline)
(sml/setup)
 #+END_SRC

** spaceline

#+BEGIN_SRC emacs-lisp
(require 'spaceline-config)
(spaceline-spacemacs-theme)
#+END_SRC

** evil-search-highlight-persist                                     :bloat:

#+BEGIN_SRC emacs-lisp
;; TODO requrie
(require 'highlight)
(require 'evil-search-highlight-persist)
(global-evil-search-highlight-persist t)

;; TODO set highlight color
;; https://github.com/juanjux/evil-search-highlight-persist/issues/1
;; (defface evil-search-highlight-persist-highlight-face
;;   '((((class color))
;;      (:background "turquoise")))
;;   "Face for the highlighted text."
;;   :group 'evil-search-highlight-persist)
#+END_SRC

** workgroups2

#+BEGIN_SRC emacs-lisp
(require 'workgroups2)
;; change workgroups session file
(setq wg-session-file (concat user-emacs-directory "persistence/workgroups"))
;; load it on startup
(workgroups-mode 1)
(wg-find-session-file (concat user-emacs-directory "persistence/workgroups"))
#+END_SRC

** recentf                                                         :builtin:

persist mru files

#+BEGIN_SRC emacs-lisp
(require 'recentf)
(recentf-mode 1)
(setq recentf-max-menu-items 50)
;; set file location
(setq recentf-save-file (expand-file-name
    (concat user-emacs-directory "persistence/recentf")))
#+END_SRC

** howdoi

become a full StackOverflow developer!

#+BEGIN_SRC emacs-lisp
(setq helm-howdoi
  '((name . "howdoi google")
    (candidates . (lambda ()
                    (funcall helm-google-suggest-default-function)))
    (action . (("howdoi" . howdoi-query)))
    (volatile)
    (requires-pattern . 3)
    (delayed)))
#+END_SRC

** markdown-mode

#+BEGIN_SRC emacs-lisp
(autoload 'markdown-mode "markdown-mode"
   "Major mode for editing Markdown files" t)
(add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))

(autoload 'gfm-mode "markdown-mode"
   "Major mode for editing GitHub Flavored Markdown files" t)
(add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode))
#+END_SRC

** eshell
fancy eshell prompt with different colors, time, pwd, version control info and horizontal line after each command.

#+BEGIN_SRC emacs-lisp
;; prompt with colors, time, pwd, vc info and horizontal line after cmds
(defmacro with-face (str &rest properties)
    `(propertize ,str 'face (list ,@properties)))

(defun shk-eshell-prompt ()
    (let ((header-bg "#fff"))
    (concat
    (with-face (format-time-string "(%Y-%m-%d %H:%M) " (current-time)) :background header-bg :foreground "#888")
    (with-face
        (or (ignore-errors (format "(%s)" (vc-responsible-backend default-directory))) "")
        :background header-bg)
    (with-face "\n" :background header-bg)
    (with-face user-login-name :foreground "blue")
    "@"
    (with-face "localhost" :foreground "green")
    (if (= (user-uid) 0)
        (with-face " #" :foreground "red")
        " $")
    " ")))
(setq eshell-prompt-function 'shk-eshell-prompt)
(setq eshell-highlight-prompt nil)
#+END_SRC

** company-emoji

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name
    (concat user-emacs-directory "other-srcs/company-emoji")))
(require 'company-emoji)

(add-to-list 'company-backends 'company-emoji)

;; macOS font
(set-fontset-font
 t 'symbol
 (font-spec :family "Apple Color Emoji") nil 'prepend)
#+END_SRC

** projectile

#+BEGIN_SRC emacs-lisp
(require 'projectile)
(projectile-mode)
#+END_SRC

** google-translate

#+BEGIN_SRC emacs-lisp
(setq google-translate-default-source-language "en"
      google-translate-default-target-language "de")
#+END_SRC

** smartparens

replaced by electric-pair-mode
#+BEGIN_SRC emacs-lisp
;; (require 'smartparens-config)
;; (add-hook 'js-mode-hook #'smartparens-mode)
;; (add-hook 'python-mode-hook #'smartparens-mode)
#+END_SRC+END_SRC

** avy

only use the current window for candidates.
#+BEGIN_SRC emacs-lisp
    (setq avy-all-windows nil)
#+END_SRC

** new package

#+BEGIN_SRC emacs-lisp
#+END_SRC

* require

lazy require packages

#+BEGIN_SRC emacs-lisp
(require 'idle-require)             ; Needed in order to use idle-require

(dolist (feature
         '(auto-compile             ; auto-compile .el files
           google-translate
           google-translate-default-ui
           zone
           expand-region
           fireplace
           json-snatcher
           undo-tree
           yasnippet
           helm-c-yasnippet
           ;; auto-complete-config
           git-gutter
           org-mode
           org-autolist
           ;; always load finally
           ox-rst
           ox-odt
           ox-md                       ; Markdown exporter (from org)
           ;; matlab                   ; matlab-mode
           ;; ob-matlab                ; org-babel matlab
           ;; ox-latex                 ; the latex-exporter (from org)
           ;; recentf                  ; recently opened files
           ;; tex-mode))               ; TeX, LaTeX, and SliTeX mode commands
           ))
  (idle-require feature))

(setq idle-require-idle-delay 5)
(idle-require-mode 1)
#+END_SRC

* functions

** yank line without newline
#+BEGIN_SRC elisp
    (defun copy-line ()
        (interactive)
            (save-excursion
              (back-to-indentation)
              (kill-ring-save
               (point)
               (line-end-position)))
               (message "1 line copied"))
#+END_SRC

** daily journal
#+begin_src elisp
    (defun daily ()
        "setup journal windows and buffers"
        (interactive)
        (delete-other-windows)
        (find-file "~/Documents/org/journal.org")
        (split-window-right)
        (evil-window-right 1)
        (find-file "~/Documents/org/agenda.org")
        (evil-window-left 1)
        (evil-goto-first-line)
        (evil-open-above 0)
        (evil-open-above 0)
        (insert "day")
        (yas-expand))
#+end_src

