emacsrc.org
** toggle word case
#+begin_src elisp
(defun toggle-word-case ()
  "Toggle the letter case of current word or text selection.
Always cycle in this order: Init Caps, ALL CAPS, all lower.

URL `http://ergoemacs.org/emacs/modernization_upcase-word.html'
Version 2016-01-08"
  (interactive)
  (let (
        (deactivate-mark nil)
        -p1 -p2)
    (if (use-region-p)
        (setq -p1 (region-beginning)
              -p2 (region-end))
      (save-excursion
        (skip-chars-backward "[:alnum:]")
        (setq -p1 (point))
        (skip-chars-forward "[:alnum:]")
        (setq -p2 (point))))
    (when (not (eq last-command this-command))
      (put this-command 'state 0))
    (cond
     ((equal 0 (get this-command 'state))
      (upcase-initials-region -p1 -p2)
      (put this-command 'state 1))
     ((equal 1  (get this-command 'state))
      (upcase-region -p1 -p2)
      (put this-command 'state 2))
     ((equal 2 (get this-command 'state))
      (downcase-region -p1 -p2)
      (put this-command 'state 0)))))
#+end_src

** recreate scratch buffer
#+BEGIN_SRC emacs-lisp
(defun create-scratch-buffer nil
    "create a scratch buffer"
    (interactive)
    (switch-to-buffer (get-buffer-create "*scratch*"))
    (lisp-interaction-mode))
#+END_SRC

** copy file name to clipboard

#+BEGIN_SRC emacs-lisp
(defun copy-file-name-to-clipboard ()
  "Copy the current buffer file name to the clipboard."
  (interactive)
  (let ((filename (if (equal major-mode 'dired-mode)
                      default-directory
                    (buffer-file-name))))
    (when filename
      (kill-new filename)
      (message "Copied buffer file name '%s' to the clipboard." filename))))
#+END_SRC

** evil shifting (< / >)
prevent losing the selection after a shift operation by re-selecting

#+BEGIN_SRC emacs-lisp
(defun evil-shift-left-visual ()
  (interactive)
  (evil-shift-left (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore))

(defun evil-shift-right-visual ()
  (interactive)
  (evil-shift-right (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore))
#+END_SRC

** source init.el

#+BEGIN_SRC emacs-lisp
(defun src-init ()
    (interactive)
    (load-file (concat user-emacs-directory "init.el")))
#+END_SRC

** helm-howdoi

#+BEGIN_SRC emacs-lisp
(defun helm-howdoi ()
    (interactive)
    (helm :sources 'helm-howdoi))
#+END_SRC

** new function

#+BEGIN_SRC emacs-lisp
#+END_SRC

* keybindings keymappings

#+BEGIN_SRC emacs-lisp
  ;; minor mode for keybindings
  (
   defvar my-keys-minor-mode-map
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "M-+") 'text-scale-adjust)
      (define-key map (kbd "M--") 'text-scale-adjust)
      (define-key map (kbd "M-0") 'text-scale-adjust)
      (define-key map (kbd "M-e") 'move-end-of-line)
      (define-key map (kbd "M-b") 'move-beginning-of-line)
      ;; macOS
      (define-key map (kbd "M-q") 'save-buffers-kill-terminal)        ; quit
      (define-key map (kbd "M-w") 'kill-buffer)                       ; close
      (define-key map (kbd "M-c") 'kill-ring-save)                    ; copy
      (define-key map (kbd "M-v") 'yank)                              ; paste
      (define-key map (kbd "M-s") 'save-buffer)                       ; save
      (define-key map (kbd "M-a") 'mark-whole-buffer)                 ; select all
      (define-key map (kbd "M-x") 'helm-M-x)
      (define-key map (kbd "\C-cl") 'org-store-link)
      (define-key map (kbd "\C-ca") 'org-agenda)
      (define-key map (kbd "C-+") 'er/expand-region)
      ;; TOOD Backspace?
      (define-key map (kbd "DEL") 'backward-delete-char)
      (define-key map (kbd "C--") 'evilnc-comment-or-uncomment-lines)

      ;; evil keymappings
      ;; normal state
      (define-key evil-normal-state-map (kbd "M-o") 'helm-find-files)
      (define-key evil-normal-state-map (kbd "M-b") 'helm-buffers-list)
      (define-key evil-normal-state-map (kbd "+") 'er/expand-region)
      (define-key evil-normal-state-map (kbd "f") 'ace-jump-mode)
      (define-key evil-normal-state-map (kbd "B") 'evil-first-non-blank)
      (define-key evil-normal-state-map (kbd "E") 'evil-end-of-line)
      (define-key evil-normal-state-map (kbd "-") 'evilnc-comment-or-uncomment-lines)
      ;; (define-key evil-normal-state-map (kbd "ä") 'delete-other-windows)
      ;; (define-key evil-normal-state-map (kbd "Ä") 'evil-search-highlight-persist-remove-all)
      (define-key evil-normal-state-map (kbd "ö") 'avy-goto-line)
      (define-key evil-normal-state-map (kbd "Ö") 'avy-goto-char)
      (define-key evil-normal-state-map (kbd "f") 'avy-goto-char-timer)
      (define-key evil-normal-state-map (kbd "F") 'avy-goto-char-in-line)
      (define-key evil-normal-state-map (kbd "C-j") 'scroll-up-command)
      (define-key evil-normal-state-map (kbd "C-k") 'scroll-down-command)
      (define-key evil-normal-state-map (kbd "~") 'toggle-word-case)
      (define-key evil-normal-state-map (kbd "º") 'evil-forward-paragraph)      ;; <alt-j>
      (define-key evil-normal-state-map (kbd "∆") 'evil-backward-paragraph)     ;; <alt-k>
      (define-key evil-normal-state-map (kbd "U") 'delete-backward-char)
      (define-key evil-normal-state-map (kbd "u") 'undo-tree-undo)
      (define-key evil-normal-state-map (kbd "Y") 'copy-line)

      ;; visual line
      (define-key evil-visual-state-map (kbd "-") 'evilnc-comment-or-uncomment-lines)
      ; Overload shifts so that they don't lose the selection
      (define-key evil-visual-state-map (kbd ">") 'evil-shift-right-visual)
      (define-key evil-visual-state-map (kbd "<") 'evil-shift-left-visual)
      (define-key evil-visual-state-map [tab] 'evil-shift-right-visual)
      (define-key evil-visual-state-map [S-tab] 'evil-shift-left-visual)
      (define-key evil-visual-state-map (kbd "B") 'evil-first-non-blank)
      (define-key evil-visual-state-map (kbd "E") 'evil-end-of-line)

      ;; evil-leader mappings
      (evil-leader/set-key
      "/" 'evil-command-window-search-forward
      "|" 'split-window-right
      "-" 'split-window-below
      "k" 'evil-window-up
      "j" 'evil-window-down
      "h" 'evil-window-left
      "l" 'evil-window-right
      "x" 'delete-other-windows    ; duplicated
      "y" 'helm-yas-complete
      "f" 'helm-for-files
      "a" 'helm-ag-project-root
      "O" 'helm-find-files
      "oh" 'helm-org-in-buffer-headings
      "oa" 'helm-org-agenda-files-headings
      "oc" 'org-capture
      "or" 'org-reset-checkbox-state-subtree
      "oe" 'org-export-dispatch
      "ota" 'org-time-stamp
      "oti" 'org-time-stamp-inactive
      "SPC" 'helm-buffers-list
      "bb" 'bookmark-set
      "bp" 'projectile-add-known-project
      "gn" 'git-gutter:next-hunk
      "gp" 'git-gutter:previous-hunk
      "gs" 'helm-google-suggest
      "v" 'visual-line-mode
      "TAB" 'mode-line-other-buffer               ; previous buffer (like 'helm-buffer-list "RET")
      "D" 'dumb-jump-go
      "d" 'anaconda-mode-show-doc
      "*" 'helm-swoop
      "ö" 'evil-search-highlight-persist-remove-all        ; duplicated
      "p" 'helm-projectile
      "P" 'helm-projectile-find-file-in-known-projects
      "sp" 'projectile-switch-project
      ;; TOTEST
      "A" 'helm-projectile-ag
      "m" 'magit-status
      "nn" 'find-file
      "ns" 'create-scratch-buffer
      "ss" 'wg-save-session
      "so" 'wg-open-session
      "sc" 'wg-save-session-as
      "S" 'src-init
      "r" 'revert-buffer
      "C" 'shell-command
      "ci" 'org-clock-in
      "co" 'org-clock-out
      "cl" 'org-clock-in-last
      "cs" 'org-clock-select-task
      "i" 'python-shell
      "Hh" 'helm-howdoi
      "Hi" 'howdoi-query-insert-code-snippet-at-point
      "tl" 'helm-semantic-or-imenu
      "tt" 'google-translate-at-point
      "tq" 'google-translate-query-translate
      ;; "t" (lambda () (interactive) (evil-ex "%s /foo/bar/g"))
      "w/" 'find-file-other-window)

      ;; macOS
      ;; map command key to meta
      (if (boundp 'ns-command-modifier)
          (setq ns-command-modifier 'meta))
      (if (boundp 'ns-option-modifier)
          (setq ns-option-modifier nil))

      ;; make use of <Meta-Up> <Meta-Down>
      ;; TODO double mapped
      (define-key input-decode-map "\e\eOA" [(meta up)])
      (define-key input-decode-map "\e\eOB" [(meta down)])
      (global-set-key [(meta up)] 'scroll-down-command)
      (global-set-key [(meta down)] 'scroll-up-command)

      map)
    "my-keys-minor-mode keymap.")

  (define-minor-mode my-keys-minor-mode
    "A minor mode so that my key settings override annoying major modes."
    :init-value t
    :lighter " my-keys")

  (my-keys-minor-mode 1)


  ;; (template insertion
  ;; TODO use yasnippet
  (defun insert-org-checkbox ()
    (interactive)
    (insert "- [ ] "))
  (global-set-key (kbd "M--") 'insert-checkbox)

  (defun insert-org-minimal-theme ()
    (interactive)
      (insert "#+SETUPFILE: ~/Settings/dotfiles/org-minimal-theme.setup"))

  (defun insert-org-title ()
    (interactive)
    (insert "#+TITLE: "))

  (defun insert-src ()
    (interactive)
    (insert "#+BEGIN_SRC emacs-lisp\n\n#+END_SRC"))
#+END_SRC

* Meta
** Todos
*** bugs
**** evil paste into /
**** Whitespace!!!!!
**** persistence
***** projectile persist known projects
***** default persistence files
**** #-files
**** undo-tree + fireplace
**** git gutter lag
*** basics
**** jumplist prestist
**** jumplist helm
**** Tabs
- 4 auf einmal löschen
- 4 auf einmal überspringen
- smart tabs
**** Encryption
**** mode-line
***** git infos
***** Sprache
**** emojis
https://github.com/iqbalansari/emacs-emojify
**** TODO FIXME BUG highlighten
http://emacs-fu.blogspot.de/2008/12/highlighting-todo-fixme-and-friends.html
**** Code folding
**** Splits
**** MRU persistent
**** Projects
**** Bookmarks
**** startify
**** big file handling
**** named regexes
  "t" (lambda () (interactive) (evil-ex "%s /foo/bar/g"))
  as helm list
***** store commands
I generally like writing custom commands, here's the one for your first replacement:

(defun replace-plus-minus ()
  (interactive)
  (replace-string "±" "\\pm" nil (point-min) (point-max)))
But, you can also use keyboard macros. Check out the wiki and docs.

Basically, you'd do:

C-x ( M-x replace-string ± RET \pm RET C-x )
Then you can name it, and save it to your .emacs:

M-x name-last-kbd-macro
M-x insert-kbd-macro

**** zooming
http://oremacs.com/2015/01/14/repeatable-commands/

*** flycheck

*** yasnippet

*** evil
