emacsrc.el

(defun copy-file-name-to-clipboard ()
  "Copy the current buffer file name to the clipboard."
  (interactive)
  (let ((filename (if (equal major-mode 'dired-mode)
                      default-directory
                    (buffer-file-name))))
    (when filename
      (kill-new filename)
      (message "Copied buffer file name '%s' to the clipboard." filename))))

(defun evil-shift-left-visual ()
  (interactive)
  (evil-shift-left (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore))

(defun evil-shift-right-visual ()
  (interactive)
  (evil-shift-right (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore))

(defun src-init ()
    (interactive)
    (load-file (concat user-emacs-directory "init.el")))

(defun helm-howdoi ()
    (interactive)
    (helm :sources 'helm-howdoi))



;; minor mode for keybindings
(defvar my-keys-minor-mode-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "M-e") 'move-end-of-line)
    (define-key map (kbd "M-b") 'move-beginning-of-line)
    ;; macOS
    (define-key map (kbd "M-q") 'save-buffers-kill-terminal)        ; quit
    (define-key map (kbd "M-w") 'kill-buffer)                       ; close
    (define-key map (kbd "M-c") 'kill-ring-save)                    ; copy
    (define-key map (kbd "M-v") 'yank)                              ; paste
    (define-key map (kbd "M-s") 'save-buffer)                       ; save
    (define-key map (kbd "M-a") 'mark-whole-buffer)                 ; select all
    (define-key map (kbd "M-x") 'helm-M-x)
    (define-key map (kbd "\C-cl") 'org-store-link)
    (define-key map (kbd "\C-ca") 'org-agenda)
    (define-key map (kbd "C-+") 'er/expand-region)
    ;; TOOD Backspace?
    (define-key map (kbd "DEL") 'backward-delete-char)
    (define-key map (kbd "C--") 'evilnc-comment-or-uncomment-lines)

    ;; evil keymappings
    ;; normal state
    (define-key evil-normal-state-map (kbd "M-o") 'helm-find-files)
    (define-key evil-normal-state-map (kbd "M-b") 'helm-buffers-list)
    (define-key evil-normal-state-map (kbd "+") 'er/expand-region)
    (define-key evil-normal-state-map (kbd "f") 'ace-jump-mode)
    (define-key evil-normal-state-map (kbd "B") 'evil-first-non-blank)
    (define-key evil-normal-state-map (kbd "E") 'evil-end-of-line)
    (define-key evil-normal-state-map (kbd "-") 'evilnc-comment-or-uncomment-lines)
    (define-key evil-normal-state-map (kbd "ä") 'delete-other-windows)
    (define-key evil-normal-state-map (kbd "Ä") 'evil-search-highlight-persist-remove-all)
    (define-key evil-normal-state-map (kbd "ö") 'avy-goto-char)
    (define-key evil-normal-state-map (kbd "Ö") 'avy-goto-line)
    (define-key evil-normal-state-map (kbd "f") 'avy-goto-char-in-line)
    (define-key evil-normal-state-map (kbd "C-j") 'scroll-up-command)
    (define-key evil-normal-state-map (kbd "C-k") 'scroll-down-command)

    ;; visual line
    (define-key evil-visual-state-map (kbd "-") 'evilnc-comment-or-uncomment-lines)
    ; Overload shifts so that they don't lose the selection
    (define-key evil-visual-state-map (kbd ">") 'evil-shift-right-visual)
    (define-key evil-visual-state-map (kbd "<") 'evil-shift-left-visual)
    (define-key evil-visual-state-map [tab] 'evil-shift-right-visual)
    (define-key evil-visual-state-map [S-tab] 'evil-shift-left-visual)

    ;; evil-leader mappings
    (evil-leader/set-key
    "k" 'evil-window-up
    "j" 'evil-window-down
    "h" 'evil-window-left
    "l" 'evil-window-right
    "x" 'delete-other-windows    ; duplicated
    "y" 'helm-yas-complete
    "f" 'helm-for-files
    "O" 'helm-find-files
    "oh" 'helm-org-in-buffer-headings
    "oa" 'helm-org-agenda-files-headings
    "oc" 'org-reset-checkbox-state-subtre
    "SPC" 'helm-buffers-list
    "B" 'bookmark-set
    "TAB" 'mode-line-other-buffer               ; previous buffer (like 'helm-buffer-list "RET")
    "d" 'dumb-jump-go
    "*" 'helm-swoop
    "ö" 'evil-search-highlight-persist-remove-all        ; duplicated
    "l" 'helm-semantic-or-imenu
    "p" 'helm-projectile
    "m" 'magit-status
    "ss" 'wg-save-session
    "so" 'wg-open-session
    "sc" 'wg-save-session-as
    "S" 'src-init
    "c" 'shell-command
    "Hh" 'helm-howdoi
    "Hi" 'howdoi-query-insert-code-snippet-at-point
    "t" (lambda () (interactive) (evil-ex "%s /foo/bar/g"))
    "w/" 'find-file-other-window)

    ;; macOS
    ;; map command key to meta
    (if (boundp 'ns-command-modifier)
        (setq ns-command-modifier 'meta))
    (if (boundp 'ns-option-modifier)
        (setq ns-option-modifier nil))

    ;; make use of <Meta-Up> <Meta-Down>
    ;; TODO double mapped
    (define-key input-decode-map "\e\eOA" [(meta up)])
    (define-key input-decode-map "\e\eOB" [(meta down)])
    (global-set-key [(meta up)] 'scroll-down-command)
    (global-set-key [(meta down)] 'scroll-up-command)

    map)
  "my-keys-minor-mode keymap.")

(define-minor-mode my-keys-minor-mode
  "A minor mode so that my key settings override annoying major modes."
  :init-value t
  :lighter " my-keys")

(my-keys-minor-mode 1)


;; (template insertion
;; TODO use yasnippet
(defun insert-org-checkbox ()
  (interactive)
  (insert "- [ ] "))
(global-set-key (kbd "M--") 'insert-checkbox)

(defun insert-org-minimal-theme ()
  (interactive)
    (insert "#+SETUPFILE: ~/Settings/dotfiles/org-minimal-theme.setup"))

(defun insert-org-title ()
  (interactive)
  (insert "#+TITLE: "))

(defun insert-src ()
  (interactive)
  (insert "#+BEGIN_SRC emacs-lisp\n\n#+END_SRC"))
